tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
tap "phrase/brewed"
tap "romkatv/powerlevel10k"
tap "thoughtbot/formulae"
brew "libyaml"
brew "python@3.12"
brew "ansible"
brew "libtiff"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "grpc"
brew "llvm"
brew "apache-arrow"
brew "gmp"
brew "coreutils"
brew "asdf"
brew "autossh"
brew "aws-vault"
brew "awscli"
brew "awsume"
brew "glib"
brew "cairo"
brew "chamber"
brew "curl"
brew "deno"
brew "docker", link: false
brew "docker-compose", link: false
brew "docutils"
brew "entr"
brew "foreman"
brew "fzf"
brew "unbound"
brew "gnutls"
brew "libksba"
brew "gnupg", link: false
brew "gpgme"
brew "shared-mime-info"
brew "libheif"
brew "libpq", link: true
brew "libxml2"
brew "libspatialite"
brew "openblas"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gh"
brew "harfbuzz"
brew "tesseract"
brew "git"
brew "go"
brew "gron"
brew "node", link: false
brew "grunt-cli"
brew "guile"
brew "htop"
brew "imagemagick"
brew "jd"
brew "openjdk"
brew "jmeter"
brew "jq"
brew "jsonpp"
brew "lazydocker"
brew "libxmlsec1"
brew "openssl@1.1"
brew "python@3.11"
brew "mitmproxy"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "oath-toolkit"
brew "openconnect"
brew "openjdk@11"
brew "osx-cpu-temp"
brew "pdftk-java"
brew "pex"
brew "pgcli"
brew "phrase-cli"
brew "python-tabulate"
brew "python@3.10"
brew "python@3.9"
brew "qt@5"
brew "rcm"
brew "redis", restart_service: true
brew "ripgrep"
brew "rpm"
brew "starship"
brew "stow"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tree"
brew "vpn-slice"
brew "wget"
brew "xpdf", link: false
brew "yarn"
brew "zsh"
brew "heroku/brew/heroku"
brew "oven-sh/bun/bun"
cask "alfred"
cask "amethyst"
cask "barrier"
cask "docker"
cask "firefox"
cask "git-credential-manager"
cask "gpg-suite"
cask "postgres-unofficial"
cask "postman"
cask "slack"
cask "talon"
cask "the-unarchiver"
cask "zoom"
vscode "akamud.vscode-theme-onedark"
vscode "alexcvzz.vscode-sqlite"
vscode "aliariff.vscode-erb-beautify"
vscode "bajdzis.vscode-database"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "cssho.vscode-svgviewer"
vscode "davidanson.vscode-markdownlint"
vscode "davidbabel.vscode-simpler-icons"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.freemarker"
vscode "denoland.vscode-deno"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "groksrc.ruby"
vscode "hashicorp.terraform"
vscode "hridoy.rails-snippets"
vscode "kaiwood.endwise"
vscode "koichisasada.vscode-rdbg"
vscode "laurenttreguier.rpm-spec"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "mohd-akram.vscode-html-format"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "nrwl.angular-console"
vscode "otovo-oss.htmx-tags"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "rvest.vs-code-prettier-eslint"
vscode "shanehofstetter.rails-i18n"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sissel.shopify-liquid"
vscode "soutaro.rbs-syntax"
vscode "stylelint.vscode-stylelint"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vangware.dark-plus-material"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vortizhe.simple-ruby-erb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wesbos.theme-cobalt2"
vscode "wingrunr21.vscode-ruby"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
