tap "ankitpokhrel/jira-cli"
tap "microsoft/mssql-release"
brew "asdf"
brew "azure-cli"
brew "coreutils"
brew "fzf"
brew "gh"
brew "jira-cli"
brew "lazydocker"
brew "lazygit"
brew "powerlevel10k"
brew "stow"
brew "tree"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools18"
cask "iterm2"
cask "ngrok"
cask "obsidian"
vscode "alexcvzz.vscode-sqlite"
vscode "aliariff.vscode-erb-beautify"
vscode "bajdzis.vscode-database"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "davidanson.vscode-markdownlint"
vscode "davidbabel.vscode-simpler-icons"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.freemarker"
vscode "dendron.dendron"
vscode "denoland.vscode-deno"
vscode "dineug.vuerd-vscode"
vscode "docker.docker"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "groksrc.ruby"
vscode "hridoy.rails-snippets"
vscode "huntertran.auto-markdown-toc"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kaiwood.endwise"
vscode "koichisasada.vscode-rdbg"
vscode "lukas-tr.materialdesignicons-intellisense"
vscode "mathiasfrohlich.kotlin"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "misterj.vue-volar-extention-pack"
vscode "mohd-akram.vscode-html-format"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "nrwl.angular-console"
vscode "otovo-oss.htmx-tags"
vscode "perkovec.emoji"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "shanehofstetter.rails-i18n"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sleistner.vscode-fileutils"
vscode "soutaro.rbs-syntax"
vscode "stylelint.vscode-stylelint"
vscode "supabase.vscode-supabase-extension"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vortizhe.simple-ruby-erb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wallabyjs.console-ninja"
vscode "wesbos.theme-cobalt2"
vscode "wscats.vue"
vscode "xadillax.viml"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
